    <?php
        require_once("header.php");
    ?>

    <main class="main">
        <h3>Строки</h3>

    <?php
        /* ******************************    Задание 19 - 1    ****************************** */
        echo "<br> Задание 19 - 1<br>";
        $str1 = "fact";
        $str1 = str_replace("f", "F", $str1);
        echo $str1 . "<br>";
        /**************************************************************************************/


        /* ******************************    Задание 19 - 2    ****************************** */
        echo "<br> Задание 19 - 2<br>";
        $name = "Ковалев Виктор Александрович";
        $arr1 = explode(' ', $name);
        $name = $arr1[1] . " " . $arr1[0];
        echo "$name<br>";
        /**************************************************************************************/


        /* ******************************    Задание 19 - 3    ****************************** */
        echo "<br> Задание 19 - 3 <span class='red'> Решение через функцию</span><br>";

        function findchar($str, $char = null)
        {
            $arr_char = mb_str_split($str);
            $cnt = 0;
            $len = count($arr_char);
            for ($i = 0; $i <= $len; $i++) {
                if ($arr_char[$i] == $char) {
                    $cnt++;
                }
            }
            return $cnt;
        }

        $message = "Привет, мир";
        echo "Во фразе '$message' содержится " . findchar($message, "и") . " раз(а) символ 'и'<br>";
        /**************************************************************************************/


        /* ******************************    Задание 19 - 4    ****************************** */
        echo "<br> Задание 19 - 4<br>";
        $str3 = "html css php";
        $arr3 = explode(' ', $str3);
        echo $arr3[0] . "<br>" . $arr3[1] . "<br>" . $arr3[2] . "<br>";
        /**************************************************************************************/


        /* ******************************    Задание 19 - 5    ****************************** */
        echo "<br> Задание 19 - 5<br>";
        $str4 = "String.png";
        if (substr($str4, -4, 4) == ".png") {
            echo "Да";
        }
        else {
            echo "Нет";
        }
        /**************************************************************************************/
    ?>

    </main>

    <?php
        include_once("footer.php");
